reports/prod_100_100user.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
           * thousand-vus: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
thousand-vus   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 9 complete and 0 interrupted iterations
thousand-vus   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.0s), 100/100 VUs, 91 complete and 0 interrupted iterations
thousand-vus   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.0s), 100/100 VUs, 165 complete and 0 interrupted iterations
thousand-vus   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m05.0s), 100/100 VUs, 195 complete and 0 interrupted iterations
thousand-vus   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m06.0s), 100/100 VUs, 285 complete and 0 interrupted iterations
thousand-vus   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m07.0s), 100/100 VUs, 333 complete and 0 interrupted iterations
thousand-vus   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m08.0s), 100/100 VUs, 395 complete and 0 interrupted iterations
thousand-vus   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m09.0s), 100/100 VUs, 470 complete and 0 interrupted iterations
thousand-vus   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m10.0s), 100/100 VUs, 519 complete and 0 interrupted iterations
thousand-vus   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m11.0s), 100/100 VUs, 588 complete and 0 interrupted iterations
thousand-vus   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m12.0s), 100/100 VUs, 626 complete and 0 interrupted iterations
thousand-vus   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m13.0s), 100/100 VUs, 695 complete and 0 interrupted iterations
thousand-vus   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m14.0s), 100/100 VUs, 717 complete and 0 interrupted iterations
thousand-vus   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m15.0s), 100/100 VUs, 782 complete and 0 interrupted iterations
thousand-vus   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m16.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
thousand-vus   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m17.0s), 100/100 VUs, 891 complete and 0 interrupted iterations
thousand-vus   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m18.0s), 100/100 VUs, 937 complete and 0 interrupted iterations
thousand-vus   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m19.0s), 100/100 VUs, 1015 complete and 0 interrupted iterations
thousand-vus   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m20.0s), 100/100 VUs, 1082 complete and 0 interrupted iterations
thousand-vus   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m21.0s), 100/100 VUs, 1132 complete and 0 interrupted iterations
thousand-vus   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m22.0s), 100/100 VUs, 1179 complete and 0 interrupted iterations
thousand-vus   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m23.0s), 100/100 VUs, 1268 complete and 0 interrupted iterations
thousand-vus   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m24.0s), 100/100 VUs, 1319 complete and 0 interrupted iterations
thousand-vus   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m25.0s), 100/100 VUs, 1376 complete and 0 interrupted iterations
thousand-vus   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m26.0s), 100/100 VUs, 1459 complete and 0 interrupted iterations
thousand-vus   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m27.0s), 100/100 VUs, 1517 complete and 0 interrupted iterations
thousand-vus   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m28.0s), 100/100 VUs, 1571 complete and 0 interrupted iterations
thousand-vus   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m29.0s), 100/100 VUs, 1623 complete and 0 interrupted iterations
thousand-vus   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m30.0s), 100/100 VUs, 1709 complete and 0 interrupted iterations
thousand-vus   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m31.0s), 100/100 VUs, 1752 complete and 0 interrupted iterations
thousand-vus   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m32.0s), 100/100 VUs, 1825 complete and 0 interrupted iterations
thousand-vus   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m33.0s), 100/100 VUs, 1873 complete and 0 interrupted iterations
thousand-vus   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m34.0s), 100/100 VUs, 1949 complete and 0 interrupted iterations
thousand-vus   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m35.0s), 100/100 VUs, 2001 complete and 0 interrupted iterations
thousand-vus   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m36.0s), 100/100 VUs, 2069 complete and 0 interrupted iterations
thousand-vus   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m37.0s), 100/100 VUs, 2143 complete and 0 interrupted iterations
thousand-vus   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m38.0s), 100/100 VUs, 2200 complete and 0 interrupted iterations
thousand-vus   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m39.0s), 100/100 VUs, 2252 complete and 0 interrupted iterations
thousand-vus   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m40.0s), 100/100 VUs, 2334 complete and 0 interrupted iterations
thousand-vus   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m41.0s), 100/100 VUs, 2392 complete and 0 interrupted iterations
thousand-vus   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m42.0s), 100/100 VUs, 2436 complete and 0 interrupted iterations
thousand-vus   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m43.0s), 100/100 VUs, 2528 complete and 0 interrupted iterations
thousand-vus   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m44.0s), 100/100 VUs, 2589 complete and 0 interrupted iterations
thousand-vus   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m45.0s), 100/100 VUs, 2634 complete and 0 interrupted iterations
thousand-vus   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m46.0s), 100/100 VUs, 2715 complete and 0 interrupted iterations
thousand-vus   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m47.0s), 100/100 VUs, 2763 complete and 0 interrupted iterations
thousand-vus   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m48.0s), 100/100 VUs, 2830 complete and 0 interrupted iterations
thousand-vus   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m49.0s), 100/100 VUs, 2904 complete and 0 interrupted iterations
thousand-vus   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m50.0s), 100/100 VUs, 2917 complete and 0 interrupted iterations
thousand-vus   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m51.0s), 100/100 VUs, 3010 complete and 0 interrupted iterations
thousand-vus   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m52.0s), 100/100 VUs, 3073 complete and 0 interrupted iterations
thousand-vus   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m53.0s), 100/100 VUs, 3125 complete and 0 interrupted iterations
thousand-vus   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m54.0s), 100/100 VUs, 3212 complete and 0 interrupted iterations
thousand-vus   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m55.0s), 100/100 VUs, 3255 complete and 0 interrupted iterations
thousand-vus   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m56.0s), 100/100 VUs, 3324 complete and 0 interrupted iterations
thousand-vus   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m57.0s), 100/100 VUs, 3389 complete and 0 interrupted iterations
thousand-vus   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m58.0s), 100/100 VUs, 3451 complete and 0 interrupted iterations
thousand-vus   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m59.0s), 100/100 VUs, 3526 complete and 0 interrupted iterations
thousand-vus   [  98% ] 100 VUs  0m59.0s/1m0s

running (1m00.0s), 100/100 VUs, 3588 complete and 0 interrupted iterations
thousand-vus   [ 100% ] 100 VUs  1m00.0s/1m0s

running (1m01.0s), 043/100 VUs, 3645 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 100 VUs  1m0s

running (1m02.0s), 015/100 VUs, 3673 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 100 VUs  1m0s

running (1m02.2s), 000/100 VUs, 3688 complete and 0 interrupted iterations
thousand-vus ✓ [ 100% ] 100 VUs  1m0s

     ✓ status is 200

     checks.........................: 100.00% ✓ 3688      ✗ 0    
     data_received..................: 1.6 MB  26 kB/s
     data_sent......................: 452 kB  7.3 kB/s
     http_req_blocked...............: avg=17.67ms  min=184ns    med=561ns    max=1.6s     p(90)=1.51µs   p(95)=1.72µs  
     http_req_connecting............: avg=4.08ms   min=0s       med=0s       max=152.79ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=638.29ms min=317.48ms med=567.3ms  max=2.41s    p(90)=966.49ms p(95)=1.15s   
       { expected_response:true }...: avg=638.29ms min=317.48ms med=567.3ms  max=2.41s    p(90)=966.49ms p(95)=1.15s   
     http_req_failed................: 0.00%   ✓ 0         ✗ 3688 
     http_req_receiving.............: avg=89.54µs  min=21.87µs  med=67.96µs  max=3.62ms   p(90)=147.45µs p(95)=164.99µs
     http_req_sending...............: avg=137.88µs min=35.74µs  med=110.71µs max=1.04ms   p(90)=245.9µs  p(95)=271.67µs
     http_req_tls_handshaking.......: avg=12.19ms  min=0s       med=0s       max=1.4s     p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=638.06ms min=317.12ms med=567.11ms max=2.4s     p(90)=966.29ms p(95)=1.15s   
     http_reqs......................: 3688    59.269775/s
     iteration_duration.............: avg=1.65s    min=1.31s    med=1.57s    max=3.41s    p(90)=2.02s    p(95)=2.23s   
     iterations.....................: 3688    59.269775/s
     vus............................: 15      min=15      max=100
     vus_max........................: 100     min=100     max=100